# Pandas 활용하기
* 데이터분석에 특화된 데이터구조를 제공하는 라이브러리(테이블 형태의 DataFrame, 리스트 형태의 Series)
* 다양한 데이터 분석 함수 제공
* 데이터베이스에서 쉽게 자료를 가져올 수 있음
* json, csv, excel, html의 table 요소 등 다양한 데이터를 불러올 수 있음
* numpy를 내부적으로 사용, numpy와 pandas간 변환이 쉬움
https://pandas.pydata.org/docs/index.html

# pandas 에서 다루는 데이터 타입 2가지
## 1) DataFrame: 2차원 형태의 표형식 데이터
* python의 dict를 기반 으로 만들어진 데이터 하나의 key에 리스트 자료가 value로 들어간 형태
* {key1: [value1, value2, value3], key2: [value1, value2, value3]}
* key는 데이터프레임의 컬럼명이 됨, value는 컬럼의 자료
* 데이터프레임은 python의 dict 사용법과 거의 비슷

## 2) Series: 1차원 형태의 벡터형식 데이터
* python의 list, tuple, ndarray의 1차원 상태와 비슷
* 이름이 있는 list
* list 사용법과 비슷, 인덱싱, 슬라이싱가능, 반복문 사용 가능

In [1]:
import pandas as pd

# 데이터 프레임 만들기
pd.DataFrame({key1: [value1, value2, value3], key2: [value1, value2, value3]})

In [2]:
df = pd.DataFrame(
    {'이름' : ['홍길동','둘리','또치','도우너'],
     '주소' : ['서울','의정부','고양시','성남시'],
    '취미' : ['음악감상','놀기','달리기','바이올린']}
)

In [3]:
df

    이름   주소    취미
0  홍길동   서울  음악감상
1   둘리  의정부    놀기
2   또치  고양시   달리기
3  도우너  성남시  바이올린

# 넘파이 기반으로 만들어졌기 때문에 넘파이 메서드 사용 가능

In [4]:
df.shape

(4, 3)

In [5]:
df.ndim

2

In [6]:
arr = df.to_numpy()
arr

array([['홍길동', '서울', '음악감상'],
       ['둘리', '의정부', '놀기'],
       ['또치', '고양시', '달리기'],
       ['도우너', '성남시', '바이올린']], dtype=object)

In [7]:
df.columns

Index(['이름', '주소', '취미'], dtype='object')

In [8]:
pd.DataFrame(arr, columns=df.columns)

    이름   주소    취미
0  홍길동   서울  음악감상
1   둘리  의정부    놀기
2   또치  고양시   달리기
3  도우너  성남시  바이올린

# 데이터 프레임 슬라이싱, .loc(인덱스명, 컬럼이름), .iloc(행인덱스, 열인덱스)

In [9]:
df.iloc[:2, :2]

    이름   주소
0  홍길동   서울
1   둘리  의정부

# 데이터 프레임에서 컬럼 1개만 출력할 때
변수명[컬럼명]

In [10]:
list(df['이름'])

['홍길동', '둘리', '또치', '도우너']

In [11]:
d = {'이름' : ['홍길동','둘리','또치','도우너'],
     '주소' : ['서울','의정부','고양시','성남시'],
    '취미' : ['음악감상','놀기','달리기','바이올린']}

In [12]:
d

{'이름': ['홍길동', '둘리', '또치', '도우너'],
 '주소': ['서울', '의정부', '고양시', '성남시'],
 '취미': ['음악감상', '놀기', '달리기', '바이올린']}

In [13]:
d['이름']

['홍길동', '둘리', '또치', '도우너']

In [14]:
for name in df['이름']:
    print(name)

홍길동
둘리
또치
도우너

In [15]:
df['이름'][1]

'둘리'

# 컬럼을 2개 이상 잘라 오고 싶을 때

In [16]:
df[['이름', '취미']]

    이름    취미
0  홍길동  음악감상
1   둘리    놀기
2   또치   달리기
3  도우너  바이올린

# 컬럼 순서를 바꾸고 싶을 때

In [17]:
df

    이름   주소    취미
0  홍길동   서울  음악감상
1   둘리  의정부    놀기
2   또치  고양시   달리기
3  도우너  성남시  바이올린

In [18]:
df[['취미', '이름', '주소']]

     취미   이름   주소
0  음악감상  홍길동   서울
1    놀기   둘리  의정부
2   달리기   또치  고양시
3  바이올린  도우너  성남시

In [19]:
df

    이름   주소    취미
0  홍길동   서울  음악감상
1   둘리  의정부    놀기
2   또치  고양시   달리기
3  도우너  성남시  바이올린

# Series 만들기
* pd.Series([리스트/튜플], name="컬럼명")
* 이름을 가지고 있는 list/벡터
* DataFrame에서 컬럼 1개를 잘라온 형태

In [20]:
ages = pd.Series([22, 33, 53], name="나이")
ages

0    22
1    33
2    53
Name: 나이, dtype: int64

In [21]:
ages.dtype

dtype('int64')

In [22]:
ages.shape

(3,)

In [23]:
ages.ndim

1

In [24]:
ages[1:3]

1    33
2    53
Name: 나이, dtype: int64

In [25]:
ages[::-1]

2    53
1    33
0    22
Name: 나이, dtype: int64

In [26]:
ages.min()

np.int64(22)

In [27]:
ages.max()

np.int64(53)

In [28]:
ages.sum()

np.int64(108)

In [29]:
ages.cumsum()

0     22
1     55
2    108
Name: 나이, dtype: int64

In [30]:
ages.mean()

np.float64(36.0)

In [31]:
ages.median()

np.float64(33.0)

# 판다스에서 자료 불러오기, 저장하기
* csv, tsv, excel, json, html, sql
* pd.read_확장자명(파일경로, 옵션)

# excel 파일 불러오기
* xls, xlsx 두가지 파일 형식이 있음
* excel 파일을 불러올 때는 openpyxl 라이브러리를 따로 설치
```python
!pip install openpyxl
```

In [32]:
# !pip install openpyxl

excel 파일은 loading 시간이 오래 걸림

In [33]:
%%time
df_excel = pd.read_excel("./data/Online Retail.xlsx")
df_excel

KeyboardInterrupt:

In [34]:
df_excel2 = pd.read_excel("./data/아파트(매매)_실거래가_20240806113828.xlsx", header=12)
df_excel2

C:\Users\haram4th\miniforge3\envs\fintech\lib\site-packages\openpyxl\styles\stylesheet.py:237: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

KeyboardInterrupt:

# csv 파일 읽어오기 ( , 로 구분된 자료가 있는 파일)

In [ ]:
%%time
df_csv = pd.read_csv("./data/Online Retail.csv")
df_csv

In [ ]:
df_csv.info()

In [ ]:
df_csv2 = pd.read_csv("./data/아파트(매매)_실거래가_20240806113828.csv", header=12, usecols=[1, 5, 6, 7 , 8, 9])
df_csv2

# json 파일 읽어오기

In [ ]:
df_json = pd.read_json("./data/서울특별시_관광지입장정보_2011_2016.json")
df_json

# HTML에서 table 데이터 읽어오기

In [ ]:
df_html = pd.read_html("./data/corpList.htm")
df_html[0]

# DB에서 자료 읽어오기

In [ ]:
from sqlalchemy import create_engine, text
import pymysql
pymysql.install_as_MySQLdb()

In [ ]:
# !pip install cryptography

In [ ]:
engine = create_engine("mysql+pymysql://root:1234@localhost:3306/ex_rate")
conn = engine.connect()
df_sql = pd.read_sql("ex_rate", con=conn)
conn.close()
df_sql

# 타이타닉 데이터셋으로 pandas 기능 익히기

In [35]:
df = pd.read_csv("./data/Titanic_train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 데이터의 일부만 보기 head(), tail()

In [36]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [37]:
df.head(60)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
37,38,0,3,"Cann, Mr. Ernest Charles",male,21.0,0,0,A./5. 2152,8.0500,NaN,S
38,39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,2,0,345764,18.0000,NaN,S
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S
41,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.0,1,0,11668,21.0000,NaN,S
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.0,1,2,SC/Paris 2123,41.5792,NaN,C
44,45,1,3,"Devaney, Miss. Margaret Delia",female,19.0,0,0,330958,7.8792,NaN,Q
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
47,48,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,14311,7.7500,NaN,Q
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
49,50,0,3,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",female,18.0,1,0,349237,17.8000,NaN,S
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S
51,52,0,3,"Nosworthy, Mr. Richard Cater",male,21.0,0,0,A/4. 39886,7.8000,NaN,S
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C
53,54,1,2,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29.0,1,0,2926,26.0000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
56,57,1,2,"Rugg, Miss. Emily",female,21.0,0,0,C.A. 31026,10.5000,NaN,S
57,58,0,3,"Novel, Mr. Mansouer",male,28.5,0,0,2697,7.2292,NaN,C
58,59,1,2,"West, Miss. Constance Mirium",female,5.0,1,2,C.A. 34651,27.7500,NaN,S
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9000,NaN,S

In [38]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [39]:
df.tail(61)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
830,831,1,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
832,833,0,3,"Saad, Mr. Amin",male,NaN,0,0,2671,7.2292,NaN,C
833,834,0,3,"Augustsson, Mr. Albert",male,23.00,0,0,347468,7.8542,NaN,S
834,835,0,3,"Allum, Mr. Owen George",male,18.00,0,0,2223,8.3000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.00,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.00,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.00,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.00,0,0,370376,7.7500,NaN,Q

# 각 컬럼의 데이터 타입 .dtypes

In [40]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# 컬럼명, non이 아닌 데이터 수, 데이터 타입 .info()
* 컬럼이 너무 많아서 Non-Null Count가 나오지 않을 때 옵션에 show_counts=True를 주면 보임

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# 숫자로 된 자료의 기초 통계량을 보고 싶을 때 .describe()

In [42]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [43]:
describe_result = df.describe(include='all')
describe_result

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Dooley, Mr. Patrick",male,NaN,NaN,NaN,347082,NaN,G6,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [52]:
describe_result.loc["25%", :]

PassengerId     223.5
Survived          0.0
Pclass            2.0
Name              NaN
Sex               NaN
Age            20.125
SibSp             0.0
Parch             0.0
Ticket            NaN
Fare           7.9104
Cabin             NaN
Embarked          NaN
Name: 25%, dtype: object

# 데이터 프레임에서 일부 컬럼만 가져오기

# 1개 컬럼만 가져오는 경우

In [53]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

# 2개 이상의 컬럼을 가져오는 경우

In [54]:
df[['Name', 'Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

# 컬럼명 추출하기 .columns

In [55]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [56]:
df[['Name', 'Age', 'Pclass', 'Survived']]

                                                  Name   Age  Pclass  Survived
0                              Braund, Mr. Owen Harris  22.0       3         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1         1
2                               Heikkinen, Miss. Laina  26.0       3         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1         1
4                             Allen, Mr. William Henry  35.0       3         0
..                                                 ...   ...     ...       ...
886                              Montvila, Rev. Juozas  27.0       2         0
887                       Graham, Miss. Margaret Edith  19.0       1         1
888           Johnston, Miss. Catherine Helen "Carrie"   NaN       3         0
889                              Behr, Mr. Karl Howell  26.0       1         1
890                                Dooley, Mr. Patrick  32.0       3         0

[891 rows x 4 columns]

# loc, iloc를 사용해서 데이터 프레임 잘라오기
* loc: 데이터프레임의 인덱스명, 컬럼명으로 데이터의 일부를 추출
  * df.loc[시작row인덱스명 : 끝row인덱스명, 시작column의 컬럼명 : 끝 column의 컬럼명]
* iloc: 데이터프레임의 인덱스 번호, 컬럼의 인덱스 번호로 데이터의 일부를 추출
  * df.iloc[시작인덱스번호 : 끝인덱스번호+1 : step, 시작column인덱스번호 : 끝 column 인덱스 번호 +1 : step]

In [57]:
df.loc[0:10, ['Name', 'Age', 'Pclass', 'Survived']]

                                                 Name   Age  Pclass  Survived
0                             Braund, Mr. Owen Harris  22.0       3         0
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1         1
2                              Heikkinen, Miss. Laina  26.0       3         1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1         1
4                            Allen, Mr. William Henry  35.0       3         0
5                                    Moran, Mr. James   NaN       3         0
6                             McCarthy, Mr. Timothy J  54.0       1         0
7                      Palsson, Master. Gosta Leonard   2.0       3         0
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0       3         1
9                 Nasser, Mrs. Nicholas (Adele Achem)  14.0       2         1
10                    Sandstrom, Miss. Marguerite Rut   4.0       3         1

In [58]:
df.loc[0:10, 'Survived']

0     0
1     1
2     1
3     1
4     0
5     0
6     0
7     0
8     1
9     1
10    1
Name: Survived, dtype: int64

In [59]:
df.loc[890, 'Name']

'Dooley, Mr. Patrick'

In [60]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [61]:
df.iloc[0:11, [3,5,2,1]]

                                                 Name   Age  Pclass  Survived
0                             Braund, Mr. Owen Harris  22.0       3         0
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1         1
2                              Heikkinen, Miss. Laina  26.0       3         1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1         1
4                            Allen, Mr. William Henry  35.0       3         0
5                                    Moran, Mr. James   NaN       3         0
6                             McCarthy, Mr. Timothy J  54.0       1         0
7                      Palsson, Master. Gosta Leonard   2.0       3         0
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0       3         1
9                 Nasser, Mrs. Nicholas (Adele Achem)  14.0       2         1
10                    Sandstrom, Miss. Marguerite Rut   4.0       3         1

In [62]:
df.iloc[0:10, 0:6]

,PassengerId,Survived,Pclass,Name,Sex,Age
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0
5,6,0,3,"Moran, Mr. James",male,NaN
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0

In [63]:
df.iloc[0:10:2, 0:6:2]

   PassengerId  Pclass     Sex
0            1       3    male
2            3       3  female
4            5       3    male
6            7       1    male
8            9       3  female

In [64]:
df.iloc[::-1, -3::]

        Fare Cabin Embarked
890   7.7500   NaN        Q
889  30.0000  C148        C
888  23.4500   NaN        S
887  30.0000   B42        S
886  13.0000   NaN        S
..       ...   ...      ...
4     8.0500   NaN        S
3    53.1000  C123        S
2     7.9250   NaN        S
1    71.2833   C85        C
0     7.2500   NaN        S

[891 rows x 3 columns]

In [65]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [66]:
df.iloc[890, 3]

'Dooley, Mr. Patrick'

In [67]:
df.iloc[890, 3] = '둘리'

In [68]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,둘리,male,32.0,0,0,370376,7.75,NaN,Q

# 컬럼에서 유일값 찾기 unique(), 유일값의 개수 nunique()

In [69]:
df['Pclass'].unique()

array([3, 1, 2])

In [70]:
df['Pclass'].nunique()

3

# 유일값의 개수를 셀때 value_counts()

In [71]:
df['Pclass'].dtype

dtype('int64')

In [72]:
df['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [73]:
df['Pclass'].value_counts(ascending=True)

Pclass
2    184
1    216
3    491
Name: count, dtype: int64

In [74]:
df['Pclass'].value_counts(sort=True)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

# 데이터를 정렬 sort_values(by='컬럼명')
* SQL의 order by 기능과 동일

In [75]:
df.sort_values(by="Age")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [76]:
# ascending=False 역순정렬
df.sort_values(by="Age", ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [77]:
df.sort_values(by=["Age", "Pclass"], ascending=False).head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
545,546,0,1,"Nicholson, Mr. Arthur Ernest",male,64.0,0,0,693,26.0000,NaN,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
570,571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S
252,253,0,1,"Stead, Mr. William Thomas",male,62.0,0,0,113514,26.5500,C87,S
555,556,0,1,"Wright, Mr. George",male,62.0,0,0,113807,26.5500,NaN,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S

# 컬럼을 인덱스로 지정하기
* set_index("컬럼명")

In [78]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,둘리,male,32.0,0,0,370376,7.7500,NaN,Q

In [79]:
df.set_index(['PassengerId'])

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,둘리,male,32.0,0,0,370376,7.7500,NaN,Q

In [80]:
df.set_index(['PassengerId'], inplace=True)

In [81]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,둘리,male,32.0,0,0,370376,7.7500,NaN,Q

# 인덱스를 컬럼으로 되돌리기
* reset_index()
* 인덱스를 초기화하고 이전 인덱스를 삭제하고 싶을 때
  * reset_index(drop=True)

In [82]:
df.reset_index(inplace=True)

In [83]:
df.reset_index(drop=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,둘리,male,32.0,0,0,370376,7.7500,NaN,Q

# 컬럼 이름 바꾸기
* rename(columns={'원래이름1':'새이름1', '원래이름2':'새이름2'}

In [84]:
df.rename(columns={'PassengerId':'승객번호', 'Embarked':'출항지'})

,승객번호,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,출항지
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,둘리,male,32.0,0,0,370376,7.7500,NaN,Q

In [85]:
df.rename(index={0:'영번', 1:'일번'})

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
영번,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
일번,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,둘리,male,32.0,0,0,370376,7.7500,NaN,Q

# 컬럼을 모두 바꾸는 법 
* df.columns = [새로운 컬럼 리스트]

In [86]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [45]:
df.columns = ['승객번호', '생존여부', '선실등급', '이름', '성별', '나이', '형제자매수',
       '부모자녀수', '티켓번호', '가격', '좌석번호', '출항지']

In [46]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 기존 데이터 프레임에 새로운 컬럼 추가하기
* 딕셔너리처럼 변수명['새컬럼명'] = 자료

In [89]:
df['가족수'] = 0

In [90]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,둘리,male,32.0,0,0,370376,7.7500,NaN,Q,0

# 컬럼 삭제하기
* del df['컬럼명']
* df.drop('컬럼명', axis=1)
* df.drop(['컬럼명1', '컬럼명2'], axis=1)

In [91]:
df.drop('가족수', axis=1)

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,둘리,male,32.0,0,0,370376,7.7500,NaN,Q

In [92]:
# df = df.drop('가족수', axis=1)
df.drop('가족수', axis=1, inplace=True)

# 컬럼끼리 연산해서 새 컬럼 만들기

In [93]:
df['가족수'] = df['형제자매수'] + df['부모자녀수']
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,둘리,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [94]:
df = df.drop(['형제자매수','부모자녀수'], axis=1)
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0

In [95]:
df.columns

Index(['승객번호', '생존여부', '선실등급', '이름', '성별', '나이', '티켓번호', '가격', '좌석번호', '출항지',
       '가족수'],
      dtype='object')

In [96]:
drop_cols = ['승객번호', '이름', '티켓번호', '가격', '좌석번호']

In [97]:
df.drop(drop_cols, axis=1)

     생존여부  선실등급      성별    나이 출항지  가족수
0       0     3    male  22.0   S    1
1       1     1  female  38.0   C    1
2       1     3  female  26.0   S    0
3       1     1  female  35.0   S    1
4       0     3    male  35.0   S    0
..    ...   ...     ...   ...  ..  ...
886     0     2    male  27.0   S    0
887     1     1  female  19.0   S    0
888     0     3  female   NaN   S    3
889     1     1    male  26.0   C    0
890     0     3    male  32.0   Q    0

[891 rows x 6 columns]

# 데이터 타입 바꾸기
* astype(자료형)
* apply(형변환함수 int, float)
* pd.to_numeric(Series)

In [98]:
df['선실등급'].dtype

dtype('int64')

In [99]:
df['선실등급'] = df['선실등급'].astype(str)

In [100]:
# dtype('O') 는 str 타입이라는 뜻
df['선실등급'].dtype

dtype('O')

In [101]:
df['선실등급'] = pd.to_numeric(df['선실등급'])

In [102]:
df['선실등급'].dtype

dtype('int64')

In [103]:
df['선실등급'].apply(str)

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: 선실등급, Length: 891, dtype: object

In [104]:
df['선실등급'].apply(lambda x : '짝수' if x % 2== 0 else '홀수')

0      홀수
1      홀수
2      홀수
3      홀수
4      홀수
       ..
886    짝수
887    홀수
888    홀수
889    홀수
890    홀수
Name: 선실등급, Length: 891, dtype: object

# 판다스 데이터프레임에서 조건에 맞는 행만 가져오기
* df[df['컬럼명'] 조건식 ]
* 조건식 연산자 >, >=, <, <=, ==, !=, &(and), |(or)

In [48]:
df[df['나이'] < 20]

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,0,1,392091,9.3500,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [105]:
df[df['나이'] < 20]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,349909,21.0750,NaN,S,4
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,237736,30.0708,NaN,C,1
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,PP 9549,16.7000,G6,S,2
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,350406,7.8542,NaN,S,0
16,17,0,3,"Rice, Master. Eugene",male,2.0,382652,29.1250,NaN,Q,5
...,...,...,...,...,...,...,...,...,...,...,...
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,392091,9.3500,NaN,S,1
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,347742,11.1333,NaN,S,2
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,2667,7.2250,NaN,C,0
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,349212,7.8958,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0

In [106]:
# 선실등급이 3인경우
df[df['선실등급'] == 3]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0
5,6,0,3,"Moran, Mr. James",male,NaN,330877,8.4583,NaN,Q,0
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,349909,21.0750,NaN,S,4
...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,7552,10.5167,NaN,S,0
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,SOTON/OQ 392076,7.0500,NaN,S,0
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,382652,29.1250,NaN,Q,5
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0

# 조건이 2개 이상 오는 경우
* df[(조건1) & (조건2)]

In [107]:
# 여성이면서 나이가 35세 초과인 행 찾기 and조건
df2_result = df[(df['성별'] == 'female') & (df['나이'] > 35)]
df2_result

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,113783,26.5500,C103,S,0
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,248706,16.0000,NaN,S,0
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,347077,31.3875,NaN,S,6
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,7546,9.4750,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,17466,25.9292,D17,S,0
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,236852,13.0000,NaN,S,0
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,11751,52.5542,D35,S,2
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,11767,83.1583,C50,C,1
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,382652,29.1250,NaN,Q,5

In [108]:
# 성별은 male, 선실등급은 1, 생존여부가 1인 사람을 모두 찾으세요.
df[(df['성별'] == 'male') & (df['선실등급'] == 1) & (df['생존여부'] == 1)]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수
23,24,1,1,"Sloper, Mr. William Thompson",male,28.00,113788,35.5000,A6,S,0
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,19947,35.5000,C52,S,0
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.00,PC 17759,63.3583,D10 D12,C,1
187,188,1,1,"Romaine, Mr. Charles Hallace (""Mr C Rolmane"")",male,45.00,111428,26.5500,NaN,S,0
209,210,1,1,"Blank, Mr. Henry",male,40.00,112277,31.0000,A31,C,0
224,225,1,1,"Hoyt, Mr. Frederick Maxfield",male,38.00,19943,90.0000,C93,S,1
248,249,1,1,"Beckwith, Mr. Richard Leonard",male,37.00,11751,52.5542,D35,S,2
298,299,1,1,"Saalfeld, Mr. Adolphe",male,NaN,19988,30.5000,C106,S,0
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,113781,151.5500,C22 C26,S,3
370,371,1,1,"Harder, Mr. George Achilles",male,25.00,11765,55.4417,E50,C,1
390,391,1,1,"Carter, Mr. William Ernest",male,36.00,113760,120.0000,B96 B98,S,3
430,431,1,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.00,110564,26.5500,C52,S,0
445,446,1,1,"Dodge, Master. Washington",male,4.00,33638,81.8583,A34,S,2
447,448,1,1,"Seward, Mr. Frederic Kimber",male,34.00,113794,26.5500,NaN,S,0
449,450,1,1,"Peuchen, Major. Arthur Godfrey",male,52.00,113786,30.5000,C104,S,0
453,454,1,1,"Goldenberg, Mr. Samuel L",male,49.00,17453,89.1042,C92,C,1
460,461,1,1,"Anderson, Mr. Harry",male,48.00,19952,26.5500,E12,S,0
484,485,1,1,"Bishop, Mr. Dickinson H",male,25.00,11967,91.0792,B49,C,1
507,508,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,111427,26.5500,NaN,S,0
512,513,1,1,"McGough, Mr. James Robert",male,36.00,PC 17473,26.2875,E25,S,0
550,551,1,1,"Thayer, Mr. John Borland Jr",male,17.00,17421,110.8833,C70,C,2
572,573,1,1,"Flynn, Mr. John Irwin (""Irving"")",male,36.00,PC 17474,26.3875,E25,S,0
587,588,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.00,13567,79.2000,B41,C,2
599,600,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.00,PC 17485,56.9292,A20,C,1
604,605,1,1,"Homer, Mr. Harry (""Mr E Haven"")",male,35.00,111426,26.5500,NaN,C,0
607,608,1,1,"Daniel, Mr. Robert Williams",male,27.00,113804,30.5000,NaN,S,0
621,622,1,1,"Kimball, Mr. Edwin Nelson Jr",male,42.00,11753,52.5542,D19,S,1
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,27042,30.0000,A23,S,0
632,633,1,1,"Stahelin-Maeglin, Dr. Max",male,32.00,13214,30.5000,B50,C,0
645,646,1,1,"Harper, Mr. Henry Sleeper",male,48.00,PC 17572,76.7292,D33,C,1
647,648,1,1,"Simonius-Blumer, Col. Oberst Alfons",male,56.00,13213,35.5000,A26,C,0
660,661,1,1,"Frauenthal, Dr. Henry William",male,50.00,PC 17611,133.6500,NaN,S,2
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.00,PC 17755,512.3292,B51 B53 B55,C,1
681,682,1,1,"Hassab, Mr. Hammad",male,27.00,PC 17572,76.7292,D49,C,0
690,691,1,1,"Dick, Mr. Albert Adrian",male,31.00,17474,57.0000,B20,S,1
701,702,1,1,"Silverthorne, Mr. Spencer Victor",male,35.00,PC 17475,26.2875,E24,S,0
707,708,1,1,"Calderhead, Mr. Edward Pennington",male,42.00,PC 17476,26.2875,E24,S,0
712,713,1,1,"Taylor, Mr. Elmer Zebley",male,48.00,19996,52.0000,C126,S,1
724,725,1,1,"Chambers, Mr. Norman Campbell",male,27.00,113806,53.1000,E8,S,1
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.00,PC 17755,512.3292,B101,C,0
740,741,1,1,"Hawksford, Mr. Walter James",male,NaN,16988,30.0000,D45,S,0
802,803,1,1,"Carter, Master. William Thornton II",male,11.00,113760,120.0000,B96 B98,S,3
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,11774,29.7000,C47,C,0
857,858,1,1,"Daly, Mr. Peter Denis",male,51.00,113055,26.5500,E17,S,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.00,111369,30.0000,C148,C,0

In [109]:
# 성별은 female, 선실등급은 1 or 2, 생존여부가 1인 사람을 모두 찾으세요.
result2 = df[(df['성별'] == 'female') & ((df['선실등급'] == 1) | (df['선실등급'] == 2)) & (df['생존여부'] == 1)]

In [110]:
result2['선실등급'].value_counts()

선실등급
1    91
2    70
Name: count, dtype: int64

In [111]:
result2.describe()

             승객번호   생존여부        선실등급          나이          가격         가족수
count  161.000000  161.0  161.000000  150.000000  161.000000  161.000000
mean   461.279503    1.0    1.434783   31.830000   69.591563    1.043478
std    244.196596    0.0    0.497275   13.418387   70.196398    1.136595
min      2.000000    1.0    1.000000    2.000000   10.500000    0.000000
25%    292.000000    1.0    1.000000   22.250000   25.929200    0.000000
50%    444.000000    1.0    1.000000   31.000000   51.862500    1.000000
75%    652.000000    1.0    2.000000   40.000000   86.500000    2.000000
max    888.000000    1.0    2.000000   63.000000  512.329200    5.000000

# 조건에 맞는 행을 찾은 후 특정 컬럼만 조회하기
df.loc[df['컬럼명] 조건식, "조회할 컬럼명"]

In [112]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0

In [113]:
# 선실등급이 1이거나 2이면서 생존한 여성 중 이름 컬럼만 보고 싶을 때
df.loc[((df['선실등급'] == 1) | (df['선실등급'] == 2)) & (df['생존여부'] == 1) & (df['성별'] == 'female'), '이름']

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
9                    Nasser, Mrs. Nicholas (Adele Achem)
11                              Bonnell, Miss. Elizabeth
15                      Hewlett, Mrs. (Mary D Kingcome)
                             ...
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
874                Abelson, Mrs. Samuel (Hannah Wizosky)
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
887                         Graham, Miss. Margaret Edith
Name: 이름, Length: 161, dtype: object

# or 조건을 하나의 조건식으로 처리 .isin([조건1, 조건2])

In [114]:
df.loc[(df['선실등급'].isin([1,2])) & (df['생존여부'] == 1) & (df['성별'] == 'female'), '이름']

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
9                    Nasser, Mrs. Nicholas (Adele Achem)
11                              Bonnell, Miss. Elizabeth
15                      Hewlett, Mrs. (Mary D Kingcome)
                             ...
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
874                Abelson, Mrs. Samuel (Hannah Wizosky)
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
887                         Graham, Miss. Margaret Edith
Name: 이름, Length: 161, dtype: object

In [115]:
# 선실등급이 1이고 생존한 남성 중 이름과 나이 컬럼만 보고 싶을 때
df.loc[(df['선실등급'] == 1) & (df['생존여부'] == 1) & (df['성별'] == 'male'), ['이름', '나이']]

                                                이름     나이
23                    Sloper, Mr. William Thompson  28.00
55                               Woolner, Mr. Hugh    NaN
97                 Greenfield, Mr. William Bertram  23.00
187  Romaine, Mr. Charles Hallace ("Mr C Rolmane")  45.00
209                               Blank, Mr. Henry  40.00
224                   Hoyt, Mr. Frederick Maxfield  38.00
248                  Beckwith, Mr. Richard Leonard  37.00
298                          Saalfeld, Mr. Adolphe    NaN
305                 Allison, Master. Hudson Trevor   0.92
370                    Harder, Mr. George Achilles  25.00
390                     Carter, Mr. William Ernest  36.00
430      Bjornstrom-Steffansson, Mr. Mauritz Hakan  28.00
445                      Dodge, Master. Washington   4.00
447                    Seward, Mr. Frederic Kimber  34.00
449                 Peuchen, Major. Arthur Godfrey  52.00
453                       Goldenberg, Mr. Samuel L  49.00
460                            Anderson, Mr. Harry  48.00
484                        Bishop, Mr. Dickinson H  25.00
507  Bradley, Mr. George ("George Arthur Brayton")    NaN
512                      McGough, Mr. James Robert  36.00
550                    Thayer, Mr. John Borland Jr  17.00
572               Flynn, Mr. John Irwin ("Irving")  36.00
587               Frolicher-Stehli, Mr. Maxmillian  60.00
599   Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")  49.00
604                Homer, Mr. Harry ("Mr E Haven")  35.00
607                    Daniel, Mr. Robert Williams  27.00
621                   Kimball, Mr. Edwin Nelson Jr  42.00
630           Barkworth, Mr. Algernon Henry Wilson  80.00
632                      Stahelin-Maeglin, Dr. Max  32.00
645                      Harper, Mr. Henry Sleeper  48.00
647            Simonius-Blumer, Col. Oberst Alfons  56.00
660                  Frauenthal, Dr. Henry William  50.00
679             Cardeza, Mr. Thomas Drake Martinez  36.00
681                             Hassab, Mr. Hammad  27.00
690                        Dick, Mr. Albert Adrian  31.00
701               Silverthorne, Mr. Spencer Victor  35.00
707              Calderhead, Mr. Edward Pennington  42.00
712                       Taylor, Mr. Elmer Zebley  48.00
724                  Chambers, Mr. Norman Campbell  27.00
737                         Lesurer, Mr. Gustave J  35.00
740                    Hawksford, Mr. Walter James    NaN
802            Carter, Master. William Thornton II  11.00
839                           Marechal, Mr. Pierre    NaN
857                         Daly, Mr. Peter Denis   51.00
889                          Behr, Mr. Karl Howell  26.00

# 특정 단어를 포함한 행 찾기
* 이름에 Joseph 이 들어간 사람 찾기
* SQL의 like %단어%
* df['컬럼명'].str.contains("찾을 단어")

In [116]:
df[df['이름'].str.contains("Joseph")]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,239865,26.0000,NaN,S,0
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,PC 17604,82.1708,NaN,C,1
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,374910,8.0500,NaN,S,0
140,141,0,3,"Boulos, Mrs. Joseph (Sultana)",female,NaN,2678,15.2458,NaN,C,2
145,146,0,2,"Nicholls, Mr. Joseph Charles",male,19.0,C.A. 33112,36.7500,NaN,S,2
194,195,1,1,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44.0,PC 17610,27.7208,B4,C,0
375,376,1,1,"Meyer, Mrs. Edgar Joseph (Leila Saks)",female,NaN,PC 17604,82.1708,NaN,C,1
454,455,0,3,"Peduzzi, Mr. Joseph",male,NaN,A/5 2817,8.0500,NaN,S,0
532,533,0,3,"Elias, Mr. Joseph Jr",male,17.0,2690,7.2292,NaN,C,2
559,560,1,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.0,345572,17.4000,NaN,S,1
578,579,0,3,"Caram, Mrs. Joseph (Maria Elias)",female,NaN,2689,14.4583,NaN,C,1
589,590,0,3,"Murdlin, Mr. Joseph",male,NaN,A./5. 3235,8.0500,NaN,S,0
608,609,1,2,"Laroche, Mrs. Joseph (Juliette Marie Louise La...",female,22.0,SC/Paris 2123,41.5792,NaN,C,3
685,686,0,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.0,SC/Paris 2123,41.5792,NaN,C,3
752,753,0,3,"Vande Velde, Mr. Johannes Joseph",male,33.0,345780,9.5000,NaN,S,0
828,829,1,3,"McCormack, Mr. Thomas Joseph",male,NaN,367228,7.7500,NaN,Q,0

# 시리즈에서 문자열 함수 사용하기

In [117]:
# 이름에서 성과 이름 분리하기
for row in df['이름'][:2]:
    last_name, first_name = row.split(", ")
    print("last_name: ", last_name, "|", "first_name: ", first_name)

last_name:  Braund | first_name:  Mr. Owen Harris
last_name:  Cumings | first_name:  Mrs. John Bradley (Florence Briggs Thayer)

# .str.split() 시리즈의 문자열을 공백을 기준으로 리스트로

In [118]:
df['이름'] = df['이름'].str.split(", ")

In [119]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수
0,1,0,3,"[Braund, Mr. Owen Harris]",male,22.0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"[Cumings, Mrs. John Bradley (Florence Briggs T...",female,38.0,PC 17599,71.2833,C85,C,1
2,3,1,3,"[Heikkinen, Miss. Laina]",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"[Futrelle, Mrs. Jacques Heath (Lily May Peel)]",female,35.0,113803,53.1000,C123,S,1
4,5,0,3,"[Allen, Mr. William Henry]",male,35.0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"[Montvila, Rev. Juozas]",male,27.0,211536,13.0000,NaN,S,0
887,888,1,1,"[Graham, Miss. Margaret Edith]",female,19.0,112053,30.0000,B42,S,0
888,889,0,3,"[Johnston, Miss. Catherine Helen ""Carrie""]",female,NaN,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"[Behr, Mr. Karl Howell]",male,26.0,111369,30.0000,C148,C,0
890,891,0,3,[둘리],male,32.0,370376,7.7500,NaN,Q,0

# df['컬럼명'].str.join(구분자) 리스트 자료를 1개의 문자열로

In [120]:
df['이름'] = df['이름'].str.join(", ")

In [121]:
df['이름']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                                   둘리
Name: 이름, Length: 891, dtype: object

In [122]:
df[['last_name', 'first_name']] = df['이름'].str.split(", ", expand=True)

In [123]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0,둘리,None

# 대 소문자 바꾸기 
str.upper, str.lower

In [124]:
df['last_name'].str.upper()

0         BRAUND
1        CUMINGS
2      HEIKKINEN
3       FUTRELLE
4          ALLEN
         ...
886     MONTVILA
887       GRAHAM
888     JOHNSTON
889         BEHR
890           둘리
Name: last_name, Length: 891, dtype: object

In [125]:
df['first_name'].str.lower()

0                                 mr. owen harris
1      mrs. john bradley (florence briggs thayer)
2                                     miss. laina
3              mrs. jacques heath (lily may peel)
4                               mr. william henry
                          ...
886                                   rev. juozas
887                          miss. margaret edith
888                miss. catherine helen "carrie"
889                               mr. karl howell
890                                          None
Name: first_name, Length: 891, dtype: object

# 문자열 안에서 특정문자를 찾아서 변경
str.replace()

In [126]:
df['first_name'].str.replace("(", "").str.replace(")", "")

0                               Mr. Owen Harris
1      Mrs. John Bradley Florence Briggs Thayer
2                                   Miss. Laina
3              Mrs. Jacques Heath Lily May Peel
4                             Mr. William Henry
                         ...
886                                 Rev. Juozas
887                        Miss. Margaret Edith
888              Miss. Catherine Helen "Carrie"
889                             Mr. Karl Howell
890                                        None
Name: first_name, Length: 891, dtype: object

# 문자열 양쪽 공백 없애기
str.strip()

In [127]:
df['first_name'].str.strip()

0                                 Mr. Owen Harris
1      Mrs. John Bradley (Florence Briggs Thayer)
2                                     Miss. Laina
3              Mrs. Jacques Heath (Lily May Peel)
4                               Mr. William Henry
                          ...
886                                   Rev. Juozas
887                          Miss. Margaret Edith
888                Miss. Catherine Helen "Carrie"
889                               Mr. Karl Howell
890                                          None
Name: first_name, Length: 891, dtype: object

# groupby
* 특정 기준 컬럼을 지정해서 다른 컬럼의 통계량(평균, 최소, 최대)
* df[['보고싶은 컬럼1', '보고싶은 컬럼2']].groupby('기준컬럼').집합함수(mean, max, min, median, count, value_counts(sort=False)

In [128]:
df.columns

Index(['승객번호', '생존여부', '선실등급', '이름', '성별', '나이', '티켓번호', '가격', '좌석번호', '출항지',
       '가족수', 'last_name', 'first_name'],
      dtype='object')

In [129]:
# 성별별 생존자수
df[['성별', '생존여부']].groupby('성별').value_counts(sort=False)

성별      생존여부
female  0        81
        1       233
male    0       468
        1       109
Name: count, dtype: int64

In [130]:
df.groupby('성별')['생존여부'].value_counts(sort=False)

성별      생존여부
female  0        81
        1       233
male    0       468
        1       109
Name: count, dtype: int64

In [131]:
# 성별별 생존율
df[['성별', '생존여부']].groupby(['성별']).mean()

            생존여부
성별
female  0.742038
male    0.188908

In [132]:
# 선실등급별 성별별 생존율
df[['선실등급', '성별', '생존여부']].groupby(['선실등급', '성별']).mean()

                 생존여부
선실등급 성별
1    female  0.968085
     male    0.368852
2    female  0.921053
     male    0.157407
3    female  0.500000
     male    0.135447

In [133]:
df[['선실등급', '성별', '생존여부']].groupby(['선실등급', '성별']).describe()

              생존여부
             count      mean       std  min  25%  50%  75%  max
선실등급 성별
1    female   94.0  0.968085  0.176716  0.0  1.0  1.0  1.0  1.0
     male    122.0  0.368852  0.484484  0.0  0.0  0.0  1.0  1.0
2    female   76.0  0.921053  0.271448  0.0  1.0  1.0  1.0  1.0
     male    108.0  0.157407  0.365882  0.0  0.0  0.0  0.0  1.0
3    female  144.0  0.500000  0.501745  0.0  0.0  0.5  1.0  1.0
     male    347.0  0.135447  0.342694  0.0  0.0  0.0  0.0  1.0

# groupby 후에 원하는 통계량을 모아서 볼 때 .agg([집합함수])

In [134]:
df[['선실등급', '성별', '생존여부']].groupby(['선실등급', '성별']).agg(['min', 'max', 'mean'])

            생존여부
             min max      mean
선실등급 성별
1    female    0   1  0.968085
     male      0   1  0.368852
2    female    0   1  0.921053
     male      0   1  0.157407
3    female    0   1  0.500000
     male      0   1  0.135447

# 피벗테이블 pivot

In [135]:
# 선실등급별 성별별 생존율
df.pivot_table(values='생존여부', index='성별', columns='선실등급')

선실등급           1         2         3
성별
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# 결측값 찾기(값이 없는 것 NaN)
* isna(), isnull()

In [136]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   승객번호        891 non-null    int64
 1   생존여부        891 non-null    int64
 2   선실등급        891 non-null    int64
 3   이름          891 non-null    object
 4   성별          891 non-null    object
 5   나이          714 non-null    float64
 6   티켓번호        891 non-null    object
 7   가격          891 non-null    float64
 8   좌석번호        204 non-null    object
 9   출항지         889 non-null    object
 10  가족수         891 non-null    int64
 11  last_name   891 non-null    object
 12  first_name  890 non-null    object
dtypes: float64(2), int64(4), object(7)
memory usage: 90.6+ KB

In [49]:
df.isna()

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자녀수,티켓번호,가격,좌석번호,출항지
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [50]:
# 각 컬럼의 결측값 개수 구하기
df.isna().sum()

승객번호       0
생존여부       0
선실등급       0
이름         0
성별         0
나이       177
형제자매수      0
부모자녀수      0
티켓번호       0
가격         0
좌석번호     687
출항지        2
dtype: int64

In [138]:
len(df)

891

In [139]:
# 각 컬럼의 결측값의 비율 계산하기
df.isna().sum() / len(df) * 100

승객번호           0.000000
생존여부           0.000000
선실등급           0.000000
이름             0.000000
성별             0.000000
나이            19.865320
티켓번호           0.000000
가격             0.000000
좌석번호          77.104377
출항지            0.224467
가족수            0.000000
last_name      0.000000
first_name     0.112233
dtype: float64

In [140]:
df.isnull().sum() / len(df) * 100

승객번호           0.000000
생존여부           0.000000
선실등급           0.000000
이름             0.000000
성별             0.000000
나이            19.865320
티켓번호           0.000000
가격             0.000000
좌석번호          77.104377
출항지            0.224467
가족수            0.000000
last_name      0.000000
first_name     0.112233
dtype: float64

# 결측값이 있는 행 삭제
* dropna()

In [141]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0,둘리,None

In [142]:
df.dropna()

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,17463,51.8625,E46,S,0,McCarthy,Mr. Timothy J
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,PP 9549,16.7000,G6,S,2,Sandstrom,Miss. Marguerite Rut
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,113783,26.5500,C103,S,0,Bonnell,Miss. Elizabeth
...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,11751,52.5542,D35,S,2,Beckwith,Mrs. Richard Leonard (Sallie Monypeny)
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,695,5.0000,B51 B53 B55,S,0,Carlsson,Mr. Frans Olof
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,11767,83.1583,C50,C,1,Potter,Mrs. Thomas Jr (Lily Alexenia Wilson)
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell

# 결측값을 다른 값으로 채워주는 함수
* fillna()

In [143]:
# 나이 컬럼에서 결측값이있는 행을 필터링
df[df['나이'].isna()]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
5,6,0,3,"Moran, Mr. James",male,NaN,330877,8.4583,NaN,Q,0,Moran,Mr. James
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,244373,13.0000,NaN,S,0,Williams,Mr. Charles Eugene
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,2649,7.2250,NaN,C,0,Masselmani,Mrs. Fatima
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,2631,7.2250,NaN,C,0,Emir,Mr. Farred Chehab
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,330959,7.8792,NaN,Q,0,O'Dwyer,"Miss. Ellen ""Nellie"""
...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,2629,7.2292,NaN,C,0,Razi,Mr. Raihed
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,CA. 2343,69.5500,NaN,S,10,Sage,"Miss. Dorothy Edith ""Dolly"""
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,345777,9.5000,NaN,S,0,van Melkebeke,Mr. Philemon
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,349217,7.8958,NaN,S,0,Laleff,Mr. Kristo
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""

In [144]:
int(df['나이'].mean())

29

In [145]:
df['나이'] = df['나이'].fillna(29)

In [146]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0,둘리,None

# 여러개의 데이터 프레임 합치기
## concat: 두개 이상의 데이터프레임을 1개로 합침
## merge: SQL의 join과 같은 역할, 공통된 기준 컬럼을 매칭해서 합침
## join: index가 같은 것 끼리 합침

In [147]:
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb

In [148]:
engine = create_engine("mysql+pymysql://kict20:kict20@221.155.18.165:3306/titanic")
conn = engine.connect()

In [149]:
passenger = pd.read_sql("passenger", con=conn)
ticket = pd.read_sql("ticket", con=conn)
survived = pd.read_sql("surv", con=conn)
conn.close()

In [150]:
passenger

,PassengerId,Name,Sex,Age,SibSp,Parch
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0
1,192,"Carbines, Mr. William",male,19.0,0,0
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0
...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0
621,197,"Mernagh, Mr. Robert",male,NaN,0,0
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1

In [151]:
ticket

     PassengerId         Ticket  Pclass      Fare    Cabin Embarked
0            486           4133       3   25.4667     None        S
1            119       PC 17558       1  247.5208  B58 B60        C
2            836       PC 17756       1   83.1583      E49        C
3            528       PC 17483       1  221.7792      C95        S
4            396         350052       3    7.7958     None        S
..           ...            ...     ...       ...      ...      ...
440          692         349256       3   13.4167     None        C
441          585           3411       3    8.7125     None        C
442          265         382649       3    7.7500     None        Q
443          328          28551       2   13.0000        D        S
444          136  SC/PARIS 2133       2   15.0458     None        C

[445 rows x 6 columns]

In [152]:
survived

     PassengerId  Survived
0            762         0
1            665         1
2            809         0
3            332         0
4             21         0
..           ...       ...
441          698         1
442          778         1
443          157         1
444          350         0
445          881         1

[446 rows x 2 columns]

# concat으로 합치기

In [153]:
# concat은 기본적으로 행방향으로 합침
pd.concat([ticket, survived])

     PassengerId    Ticket  Pclass      Fare    Cabin Embarked  Survived
0            486      4133     3.0   25.4667     None        S       NaN
1            119  PC 17558     1.0  247.5208  B58 B60        C       NaN
2            836  PC 17756     1.0   83.1583      E49        C       NaN
3            528  PC 17483     1.0  221.7792      C95        S       NaN
4            396    350052     3.0    7.7958     None        S       NaN
..           ...       ...     ...       ...      ...      ...       ...
441          698       NaN     NaN       NaN      NaN      NaN       1.0
442          778       NaN     NaN       NaN      NaN      NaN       1.0
443          157       NaN     NaN       NaN      NaN      NaN       1.0
444          350       NaN     NaN       NaN      NaN      NaN       0.0
445          881       NaN     NaN       NaN      NaN      NaN       1.0

[891 rows x 7 columns]

In [154]:
# 열방향으로 합칠 경우 axis=1
pd.concat([ticket, survived], axis=1)

,PassengerId,Ticket,Pclass,Fare,Cabin,Embarked,PassengerId,Survived
0,486.0,4133,3.0,25.4667,None,S,762,0
1,119.0,PC 17558,1.0,247.5208,B58 B60,C,665,1
2,836.0,PC 17756,1.0,83.1583,E49,C,809,0
3,528.0,PC 17483,1.0,221.7792,C95,S,332,0
4,396.0,350052,3.0,7.7958,None,S,21,0
...,...,...,...,...,...,...,...,...
441,585.0,3411,3.0,8.7125,None,C,698,1
442,265.0,382649,3.0,7.7500,None,Q,778,1
443,328.0,28551,2.0,13.0000,D,S,157,1
444,136.0,SC/PARIS 2133,2.0,15.0458,None,C,350,0
445,NaN,NaN,NaN,NaN,NaN,NaN,881,1

# merge: SQL의 조인과 아주 유사 기본 inner

In [155]:
# select * from ticket as t left join survived as s on t.passengerid = s.passengerid
pd.merge(passenger, survived, how='left', on='PassengerId')

,PassengerId,Name,Sex,Age,SibSp,Parch,Survived
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0,1.0
1,192,"Carbines, Mr. William",male,19.0,0,0,NaN
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0,NaN
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1,NaN
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,NaN
...,...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0,NaN
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,NaN
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0,1.0
621,197,"Mernagh, Mr. Robert",male,NaN,0,0,0.0
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1,NaN

In [156]:
pd.merge(passenger, survived, how='inner', on='PassengerId')

,PassengerId,Name,Sex,Age,SibSp,Parch,Survived
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0,1
1,400,"Trout, Mrs. William H (Jessie L)",female,28.0,0,0,1
2,253,"Stead, Mr. William Thomas",male,62.0,0,0,0
3,71,"Jenkin, Mr. Stephen Curnow",male,32.0,0,0,0
4,273,"Mellinger, Mrs. (Elizabeth Anne Maidment)",female,41.0,0,1,1
...,...,...,...,...,...,...,...
301,346,"Brown, Miss. Amelia ""Mildred""",female,24.0,0,0,1
302,536,"Hart, Miss. Eva Miriam",female,7.0,0,2,1
303,212,"Cameron, Miss. Clear Annie",female,35.0,0,0,1
304,538,"LeRoy, Miss. Bertha",female,30.0,0,0,1
305,197,"Mernagh, Mr. Robert",male,NaN,0,0,0

In [157]:
pd.merge(pd.merge(passenger, survived, how='right', on='PassengerId'), ticket, how='left', on='PassengerId')

,PassengerId,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
0,762,"Nirva, Mr. Iisakki Antino Aijo",male,41.0,0.0,0.0,0,NaN,NaN,NaN,NaN,NaN
1,665,"Lindqvist, Mr. Eino William",male,20.0,1.0,0.0,1,NaN,NaN,NaN,NaN,NaN
2,809,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,NaN
3,332,"Partner, Mr. Austen",male,45.5,0.0,0.0,0,NaN,NaN,NaN,NaN,NaN
4,21,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
441,698,"Mullens, Miss. Katherine ""Katie""",female,NaN,0.0,0.0,1,NaN,NaN,NaN,NaN,NaN
442,778,NaN,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
443,157,"Gilnagh, Miss. Katherine ""Katie""",female,16.0,0.0,0.0,1,NaN,NaN,NaN,NaN,NaN
444,350,"Dimic, Mr. Jovan",male,42.0,0.0,0.0,0,NaN,NaN,NaN,NaN,NaN
445,881,NaN,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN

In [158]:
ticket.sort_values(by='PassengerId')

     PassengerId            Ticket  Pclass     Fare Cabin Embarked
190            1         A/5 21171       3   7.2500  None        S
383            3  STON/O2. 3101282       3   7.9250  None        S
193            4            113803       1  53.1000  C123        S
409            5            373450       3   8.0500  None        S
189            9            347742       3  11.1333  None        S
..           ...               ...     ...      ...   ...      ...
80           885   SOTON/OQ 392076       3   7.0500  None        S
128          886            382652       3  29.1250  None        Q
47           887            211536       2  13.0000  None        S
423          888            112053       1  30.0000   B42        S
109          891            370376       3   7.7500  None        Q

[445 rows x 6 columns]

# join 기본 join 값이 left 기준은 데이터프레임의 index

In [159]:
passenger.join(survived)

ValueError: columns overlap but no suffix specified: Index(['PassengerId'], dtype='object')

In [160]:
passenger = passenger.set_index("PassengerId")
passenger

,Name,Sex,Age,SibSp,Parch
PassengerId,,,,,
193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0
192,"Carbines, Mr. William",male,19.0,0,0
715,"Greenberg, Mr. Samuel",male,52.0,0,0
533,"Elias, Mr. Joseph Jr",male,17.0,1,1
133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0
...,...,...,...,...,...
580,"Jussila, Mr. Eiriik",male,32.0,0,0
503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0
538,"LeRoy, Miss. Bertha",female,30.0,0,0
197,"Mernagh, Mr. Robert",male,NaN,0,0
176,"Klasen, Mr. Klas Albin",male,18.0,1,1

In [161]:
survived = survived.set_index('PassengerId')

In [162]:
survived

             Survived
PassengerId
762                 0
665                 1
809                 0
332                 0
21                  0
...               ...
698                 1
778                 1
157                 1
350                 0
881                 1

[446 rows x 1 columns]

In [163]:
passenger.join(survived)

,Name,Sex,Age,SibSp,Parch,Survived
PassengerId,,,,,,
193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0,1.0
192,"Carbines, Mr. William",male,19.0,0,0,NaN
715,"Greenberg, Mr. Samuel",male,52.0,0,0,NaN
533,"Elias, Mr. Joseph Jr",male,17.0,1,1,NaN
133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,NaN
...,...,...,...,...,...,...
580,"Jussila, Mr. Eiriik",male,32.0,0,0,NaN
503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,NaN
538,"LeRoy, Miss. Bertha",female,30.0,0,0,1.0
197,"Mernagh, Mr. Robert",male,NaN,0,0,0.0
176,"Klasen, Mr. Klas Albin",male,18.0,1,1,NaN

In [164]:
passenger.join(survived, how='outer')

,Name,Sex,Age,SibSp,Parch,Survived
PassengerId,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,NaN
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,1.0
3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,NaN
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,NaN
5,"Allen, Mr. William Henry",male,35.0,0.0,0.0,NaN
...,...,...,...,...,...,...
886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0.0,5.0,NaN
887,"Montvila, Rev. Juozas",male,27.0,0.0,0.0,NaN
888,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,NaN
889,NaN,NaN,NaN,NaN,NaN,0.0
890,NaN,NaN,NaN,NaN,NaN,1.0

# 중복 여부 확인 및 제거하기
* .duplicated(): 중복 확인 개수
* .drop_duplicates(): 중복 행 제거

In [165]:
df2 = pd.concat([df, df, df])
df2

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0,둘리,None

In [166]:
df2

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0,둘리,None

In [167]:
df2[df2.duplicated()]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0,둘리,None

In [168]:
# 중복의 기준 컬럼을 지정해서 중복 탐색
df2.duplicated(subset='승객번호').sum()

np.int64(1782)

In [169]:
df2[df2.duplicated(subset='승객번호')]

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0,둘리,None

In [170]:
# 중복된 행 삭제
df2.drop_duplicates()

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0,둘리,None

In [171]:
# 중복된 행 삭제 + 중복 기준 지정
df2.drop_duplicates(subset=['승객번호', 'last_name'])

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0,둘리,None

In [172]:
# 중복된 행 삭제 + 중복 기준 지정 + 남길 데이터
df2.drop_duplicates(subset=['승객번호'], keep='last')

,승객번호,생존여부,선실등급,이름,성별,나이,티켓번호,가격,좌석번호,출항지,가족수,last_name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S,0,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,B42,S,0,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,W./C. 6607,23.4500,NaN,S,3,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C,0,Behr,Mr. Karl Howell
890,891,0,3,둘리,male,32.0,370376,7.7500,NaN,Q,0,둘리,None

In [173]:
# 중복된 행 삭제 + 중복 기준 지정 + 남길 데이터
df2.drop_duplicates(subset=['승객번호'], keep=False)

Empty DataFrame
Columns: [승객번호, 생존여부, 선실등급, 이름, 성별, 나이, 티켓번호, 가격, 좌석번호, 출항지, 가족수, last_name, first_name]
Index: []

In [175]:
passenger.reset_index(inplace=True)

In [176]:
passenger

,PassengerId,Name,Sex,Age,SibSp,Parch
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0
1,192,"Carbines, Mr. William",male,19.0,0,0
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0
...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0
621,197,"Mernagh, Mr. Robert",male,NaN,0,0
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1

In [177]:
ticket

     PassengerId         Ticket  Pclass      Fare    Cabin Embarked
0            486           4133       3   25.4667     None        S
1            119       PC 17558       1  247.5208  B58 B60        C
2            836       PC 17756       1   83.1583      E49        C
3            528       PC 17483       1  221.7792      C95        S
4            396         350052       3    7.7958     None        S
..           ...            ...     ...       ...      ...      ...
440          692         349256       3   13.4167     None        C
441          585           3411       3    8.7125     None        C
442          265         382649       3    7.7500     None        Q
443          328          28551       2   13.0000        D        S
444          136  SC/PARIS 2133       2   15.0458     None        C

[445 rows x 6 columns]

In [179]:
survived.reset_index(inplace=True)

In [180]:
survived

     PassengerId  Survived
0            762         0
1            665         1
2            809         0
3            332         0
4             21         0
..           ...       ...
441          698         1
442          778         1
443          157         1
444          350         0
445          881         1

[446 rows x 2 columns]

In [181]:
survived.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 446 entries, 0 to 445
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  446 non-null    int64
 1   Survived     446 non-null    int64
dtypes: int64(2)
memory usage: 7.1 KB

In [182]:
ticket.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  445 non-null    int64
 1   Ticket       445 non-null    object
 2   Pclass       445 non-null    int64
 3   Fare         445 non-null    float64
 4   Cabin        97 non-null     object
 5   Embarked     444 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 21.0+ KB

In [183]:
passenger.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 623 entries, 0 to 622
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  623 non-null    int64
 1   Name         623 non-null    object
 2   Sex          623 non-null    object
 3   Age          501 non-null    float64
 4   SibSp        623 non-null    int64
 5   Parch        623 non-null    int64
dtypes: float64(1), int64(3), object(2)
memory usage: 29.3+ KB

In [184]:
pd.merge(ticket, survived, how='inner', on="PassengerId")

Empty DataFrame
Columns: [PassengerId, Ticket, Pclass, Fare, Cabin, Embarked, Survived]
Index: []

In [187]:
for num in ticket['PassengerId']:
    if num in survived["PassengerId"]:
        print(num)

119
396
92
223
133
362
87
14
11
113
318
208
359
145
315
79
180
374
128
204
416
411
106
249
57
427
105
422
437
109
336
15
363
166
181
41
243
373
97
351
428
244
107
42
408
63
353
324
61
112
255
220
394
170
344
54
421
440
393
361
20
184
404
300
312
191
75
378
194
192
55
12
283
139
298
339
154
233
345
142
432
323
319
165
278
46
118
228
279
50
214
282
43
90
65
334
10
17
236
146
9
1
4
386
176
152
354
23
62
27
123
429
141
349
280
83
51
52
200
308
245
338
291
67
78
110
95
258
195
47
190
357
230
32
444
234
232
426
268
216
309
19
151
38
241
368
431
403
199
263
392
168
235
225
202
124
117
381
153
370
367
419
45
287
306
442
143
248
187
186
286
407
94
443
137
201
264
355
172
178
399
81
375
31
274
213
156
231
398
29
285
414
417
182
269
397
307
179
135
155
185
49
28
3
53
226
91
229
196
325
206
171
250
126
22
284
162
138
102
164
5
210
224
74
322
380
88
66
371
114
72
60
24
265
328
136

In [191]:
temp1 = ticket[['PassengerId']].sort_values(by='PassengerId')
temp2 = survived[['PassengerId']].sort_values(by='PassengerId')

In [206]:
temp3 = pd.concat([temp1, temp2]) 
temp3

     PassengerId
190            1
383            3
193            4
409            5
189            9
..           ...
445          881
123          882
199          884
38           889
43           890

[891 rows x 1 columns]

In [208]:
temp3.duplicated().sum()

np.int64(0)